# Macro Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Macro Class
Members See Also
---
An individual Autodesk Revit Macro which can be executed.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class Macro : IDisposable
```

Visual Basic
---
```text
Public Class Macro _
	Implements IDisposable
```

Visual C++
---
```text
public ref class Macro : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Macros..::..Macro
# See Also
Macro Members
Autodesk.Revit.DB.Macros Namespace